Repository: giellalt/corpus-sme
Catalog: prestable/tmx/swe/admin/sd/www.samediggi.se/71259.html.tmx
Source language: swe
Languages: sme

source: Folkrätt - Sametinget
sme: Álbmotriekti - Sametinget

source: Vad är folkrätt ?
sme: Mii lea álbmotriekti ?

source: Internationell rätt är ett område inom juridiken som behandlar förhållandet mellan stater.
sme: Riikkaidgaskasaš riekti lea juridihkkasuorgi mii gieđahallá oktavuođa stáhtaid gaskka.

source: Internationell rätt delas i sin tur upp i folkrätt och internationell privaträtt.
sme: Riikkaidgaskasaš riektesuorggi sáhttá fas juohkit guovtti oassái, álbmotriektin ja riikkaidgaskasaš priváhtariektin.

source: och
sme: Riikkaidgaskasaš riekti Riikkaidgaskasaš rievtti vuođđu lea árbevierroriekti (dahje vieruiduvvon dološ riekti) ja traktáhtavuođđuduvvon riekti.

source: Sedvanerätt är oskrivna regler som är bindande för alla stater, därför att de anses vara både praktiska och moraliskt riktiga.
sme: Árbevierroriekti leat njuolggadusat mat eai leat čállojuvvon muhto mat goitge geatnegahttet visot stáhtaid dannego dat adnojit sihke praktihkalaččat ja morálalaččat njuolgan.

source: Traktatsbaserad rätt bygger på skrivna avtal eller konventioner.
sme: Traktáhtavuođđuduvvon riekti leat ges čállojuvvon šiehtadusat dahje konvenšuvnnat.

source: Den så kallade Wienkonventionen från 1969 skapade ett system för hur sedvanerättens politiska avtal ska förvandlas till juridiska dokument, till exempel hur ingångna avtal ska hållas.
sme: Jagi 1969 Wienkonvenšuvnnas lea vuogádat dasa goht árbevierrorievtti politihkalaš soahpamušaid sáhttá heivehit juridihkalaš dokumeantan, ovdamearkka dihte goht soahpamušaid galgá doallat.

source: Den senare reglerar individers tvister över nationsgränser.
sme: Riikkaidgaskasaš rievtti sáhttá juohkit álbmotriektin ja riikkaidgaskasaš priváhtariektin.

source: mänskliga rättigheter.
sme: Dat maŋit mudde ovttaskas olbmuid nákkuid riikkarájiid rastá.

source: Folkrättslig praxis (internationell sedvänja) har utvecklats under mycket lång tid.
sme: Álbmotrievttálaš geavat (riikkaidgaskasaš vierut) lea guhkes áiggi vuollái ovdánan.

source: Därtill kommer internationella avtal och beslut av internationella organisationer som till exempel FN.
sme: Dasto gávdnojit vel riikkaidgaskasaš šiehtadusat ja mearrádusat maid sierralágan organisašuvnnat leat dahkan, ovdamearkka dihte ON.

source: Stater, internationella organisationer, företag och enskilda individer berörs av folkrätten.
sme: Álbmotriekti guoská stáhtaide, riikkaidgaskasaš organisašuvnnaide, fitnodagaide ja ovttaskas olbmuide.

source: Den primära folkrätten innehåller regler som är bindande även för de stater som inte ratificerat tillämpliga internationella avtal eller erkänner viss internationell sedvänja.
sme: Vuđolaš álbmotriekti Vuđolaš álbmotrievttis leat njuolggadusat mat geatnegahttet maiddái daid stáhtaid mat eai leat vuolláičállán riikkaidgaskasaš šiehtadusaid dahje mat eai leat dohkkehan dihto riikkaidgaskasaš vieruid.

source: En del menar att de mänskliga rättigheterna borde vara överordnade övriga delar av folkrätten.
sme: Muhtumat oaivvildit ahte olmmošvuoigatvuođat galggale leat bajemusas álbmotrievtti surggiin.

source: Andra stater skulle då vara skyldiga att ingripa när brott mot de mänskliga rättigheterna begås, även om det innebär att man bryter mot andra delar i folkrätten.
sme: Dalle livčče iežá stáhtat geatnegasat seaguhit iežaset áššái jus olmmošvuoigatvuođat rihkkojuvvojit, vaikko vel dainna rihkkot ge iežá osiid álbmotrievttis.
